<template>
  <h2>Особенности массивов javascript</h2>
  <AppOrderedList :list="arrays" />
</template>

<script setup>
import AppOrderedList from '@/components/AppOrderedList.vue';

const arrays = [
  {
    title: 'Динамический размер.',
    text: 'Массивы в JavaScript автоматически растут и сокращаются по мере добавления или удаления '
      + 'элементов.',
  },
  {
    title: 'Любые типы данных.',
    text: 'Массивы в JavaScript могут содержать элементы любого типа данных, включая строки, '
      + 'числа, объекты, другие массивы и даже функции или даты.',
  },
  {
    title: 'Индексация.',
    text: 'Доступ к элементам массива осуществляется по их индексу, начинающемуся с 0.',
  },
  {
    title: 'Методы.',
    text: 'Массивы в JavaScript имеют множество встроенных методов для манипулирования данными.',
  },
  {
    title: 'Изменяемость.',
    text: 'Массивы в JavaScript изменяемы. Это значит, что вы можете изменять, добавлять или '
      + 'удалять элементы после создания массива.',
  },
  {
    title: 'Итерация.',
    text: 'Массивы могут быть легко перебраны с помощью циклов for, for...of или метода forEach.',
  },
  {
    title: 'Доступ к свойствам.',
    text: 'Поскольку массивы в JavaScript являются объектами, они имеют свойства и методы. '
      + 'Свойство length возвращает количество элементов в массиве.',
  },
  {
    title: 'Многомерные массивы.',
    text: 'Массивы в JavaScript могут содержать другие массивы, создавая многомерные массивы. '
      + 'Это может быть полезно для создания матриц или списков смежности в графах.',
  },
  {
    title: 'Типизированные массивы.',
    text: 'Для определенных приложений, где требуется больше контроля над памятью и '
      + 'производительностью, JavaScript предоставляет типизированные массивы, такие как Int8Array, '
      + 'Uint32Array и Float64Array. Эти массивы обеспечивают контроль над бинарными данными на низком уровне.',
  },
];
</script>
