<template>
  <h2>Стеки и очереди</h2>
  <span class="other-text">
    В то время как JavaScript не имеет встроенных стеков или очередей, эти структуры данных
    могут быть легко реализованы с помощью массивов. Методы массивов push и pop обеспечивают
    поведение стека (LIFO - последним пришел, первым ушел), а методы push и shift обеспечивают
    поведение очереди (FIFO - первым пришел, первым ушел).
  </span>
  <h2>WeakSets и WeakMaps</h2>
  <span class="other-text">
    Эти структуры данных похожи на множества и карты, но с ключевым отличием: они не предотвращают
    сборку мусора для своих элементов или ключей. Это может быть полезно для решения сложных
    проблем управления памятью.
  </span>
  <h2>
    Кучи, бинарные деревья поиска
    <br>
    и другие сложные структуры данных
  </h2>
  <span class="other-text">
    JavaScript не имеет встроенных структур данных для этих типов, но они могут быть реализованы с
    помощью других структур данных, таких как массивы и объекты.
  </span>
</template>

<style lang="scss">
.other-text {
  width: 80%;
}
</style>
<script setup lang="ts">
</script>
