<template>
  <h2>Sets</h2>
  <span>
    Set представляет собой коллекцию значений, в которой каждое значение может появиться только
    один раз.
    <br>
    Он похож на массив, но без каких-либо дублирующих значений.
  </span>
  <AppOrderedList :list="sets" />
  <h2>Maps</h2>
  <span>
    Map представляет собой коллекцию пар ключ-значение, и она похожа на обычный объект JavaScript,
    <br>
    но с некоторыми отличиями и дополнительными возможностями.
  </span>
  <AppOrderedList :list="maps" />
</template>

<script setup>
import AppOrderedList from '@/components/AppOrderedList.vue';

const sets = [
  {
    text: 'В Set можно добавлять значения с помощью метода add.',
  },
  {
    text: 'Метод has можно использовать для проверки, содержит ли Set определенное значение.',
  },
  {
    text: 'Метод delete удаляет элемент из коллекции Set.',
  },
  {
    text: 'Метод clear удаляет все элементы из Set.',
  },
  {
    text: 'Свойство size возвращает количество элементов в Set.',
  },
  {
    text: 'Set является итерабельным и может быть перебран с помощью методов, таких как forEach или for...of.',
  },
  {
    text: 'Нет способа обратиться к элементу Set по индексу, как это делается в массивах, поскольку Set не является индексированной коллекцией.',
  },
];

const maps = [
  {
    text: 'В отличие от объектов, ключами в Map могут быть любые значения (объекты и примитивные значения).',
  },
  {
    text: 'Метод set используется для добавления новых пар ключ-значение в Map.',
  },
  {
    text: 'Метод get используется для чтения значений из Map по ключу.',
  },
  {
    text: 'Метод has проверяет, содержит ли Map значение для определенного ключа.',
  },
  {
    text: 'Метод delete удаляет пару ключ-значение по ключу.',
  },
  {
    text: 'Метод clear удаляет все пары ключ-значение из Map.',
  },
  {
    text: 'Свойство size возвращает количество пар ключ-значение в Map.',
  },
  {
    text: 'Map также является итерабельным и можно перебирать ключи, значения или пары ключ-значение с помощью различных методов, таких как keys, values или entries соответственно.',
  },
];
</script>
