<template>
  <h2>SPA Architecture</h2>
  <AppOrderedList :list="spa" />
</template>

<script setup>
import AppOrderedList from '@/components/AppOrderedList.vue';

const spa = [
  {
    title: 'MVC (Model-View-Controller).',
    text: 'Это классический шаблон проектирования, который разделяет приложение на три компонента: модель, представление и контроллер. Это позволяет отделять данные и бизнес-логику приложения от пользовательского интерфейса и обработки событий.',
    routeName: 'mvc',
    name: 'MVC',
  },
  {
    title: 'MVVM (Model-View-ViewModel).',
    text: 'Это адаптация MVC, которая была специально разработана для упрощения связывания данных в пользовательском интерфейсе. MVVM разделяет приложение на модель, представление и "представление модели", которое представляет собой абстракцию представления, которую можно легко связать с данными. Хорошо реализован во Vue.',
    routeName: 'mvvm',
    name: 'MVVM',
  },
  {
    title: 'Flux / Redux.',
    text: 'Flux - это архитектурный шаблон, разработанный Facebook, который реализует однонаправленный поток данных. Redux - это популярная библиотека JavaScript, которая реализует Flux. В этом подходе "состояние" приложения управляется централизованным "стором", который обновляется на основе действий, вызванных пользовательским интерфейсом. Во Vue это Vuex и Pinia.',
  },
  {
    title: 'Component-Based Architecture.',
    text: 'Этот подход, который стал особенно популярен с развитием фреймворков, таких как React, разбивает пользовательский интерфейс на переиспользуемые "компоненты". Каждый компонент имеет свое собственное состояние и логику, что позволяет создавать более модульные и легко управляемые приложения.',
    routeName: 'component',
    name: 'Component-Based',
  },
  {
    title: 'Micro Frontends.',
    text: 'Этот подход довольно новый и включает разбиение приложения на множество небольших частей или "микрофронтов", которые могут разрабатываться, развертываться и масштабироваться независимо друг от друга. Это может быть особенно полезно для больших команд и сложных приложений.',
    routeName: 'micro',
    name: 'Micro Frontends',
  },
  {
    title: 'Feature-sliced.',
    text: 'Это подход к архитектуре фронтенда, который предполагает разделение кода по "функциональности" или "фичам", а не по типу сущности (например, компоненты, контейнеры, утилиты и т.д.). Это упрощает навигацию и обслуживание кода, особенно в больших проектах. Основной принцип подхода Feature-sliced — каждая функция (фича) приложения, например, "авторизация", "профиль пользователя", "поиск" и так далее, должна быть самодостаточной и включать все, что необходимо для реализации этой функции.',
  },
];
</script>
